export const fighters = [
  {
    "name": "Алексей Ильенко",
    "nickname": "Phenomenal",
    "image": "/fighters/Aleksey_Ilyenko.png",
    "url": "/fighters/aleksey_ilyenko",
    "nationality": "russia",
    "weightClass": "Лёгкий вес",
    "record": "9-5-0",
    "details": {
      "Возраст": "26 лет (родился 7 июня 1998 года)",
      "Рост": "180 см",
      "Вес": "70 кг",
      "Город": "Калининград, Россия",
      "Команда": "Sport Club First Line"
    },
    "stats": {
      "Победы": 9,
      "Поражения": 5,
      "Нокаутов": 9,
      "Сабмишены": 0,
      "Решения": 0
    },
    "fightHistory": [
      {
        "date": "13 августа 2022",
        "opponent": "Денис Сулимов",
        "result": "Loss",
        "method": "ТКО (удары)",
        "round": 1,
        "time": "2:10",
        "event": "RCC: Intro 22"
      },
      {
        "date": "27 ноября 2021",
        "opponent": "Далгат Магомедрагимов",
        "result": "Win",
        "method": "ТКО (удар ногой в голову)",
        "round": 2,
        "time": "4:33",
        "event": "AMC Fight Nights 106"
      },
      {
        "date": "23 февраля 2021",
        "opponent": "Владимир Пальченков",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "RCC: Intro 11"
      },
      {
        "date": "20 июня 2020",
        "opponent": "Илья Фрейманов",
        "result": "Loss",
        "method": "ТКО",
        "round": 2,
        "time": "2:10",
        "event": "MMA Series 7"
      },
      {
        "date": "28 июня 2019",
        "opponent": "Йойсланди Исхиердо",
        "result": "Loss",
        "method": "Дисквалификация (нелегальный удар ногой)",
        "round": 2,
        "time": "0:47",
        "event": "M-1 Challenge 102"
      }
    ],
    "biography": [
      "Алексе́й Илье́нко — российский боец смешанных единоборств, выступающий в лёгкой весовой категории. Представляет команду Sport Club First Line из Калининграда, Россия.",
      "Начал профессиональную карьеру в ММА в 2016 году, участвуя в различных турнирах и соревнованиях.",
      "За свою карьеру провел 14 боев, одержав 9 побед, все из которых — нокаутом.",
      "Известен своей агрессивной манерой ведения боя и стремлением завершить поединок досрочно.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Зулузиньо",
    "nickname": "LITTLE ZULU",
    "image": "/fighters/zulu.png",
    "url": "/fighters/zulu",
    "nationality": "brazil",
    "weightClass": "super-heavyweight",
    "record": "12-12-0",
    "details": {
      "Возраст": "46 лет",
      "Дата рождения": "19 мая 1978 года",
      "Рост": "200 см",
      "Вес": "198 кг",
      "Город": "Сан-Луис, Мараньян, Бразилия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 12,
      "Поражения": 12,
      "Нокауты": 10,
      "Сабмишены": 1,
      "Решения": 1
    },
    "fightHistory": [
      {
        "date": "2022-09-24",
        "opponent": "Серинь Усман Диа",
        "result": "Loss",
        "method": "TKO (удары)",
        "round": 1,
        "time": "0:43",
        "event": "MMA Attack 4"
      },
      {
        "date": "2022-09-03",
        "opponent": "Петр Романкевич",
        "result": "Loss",
        "method": "KO (колено)",
        "round": 1,
        "time": "4:53",
        "event": "AMC Fight Nights 114"
      },
      {
        "date": "2007-12-31",
        "opponent": "Икухиса Минова",
        "result": "Win",
        "method": "TKO (остановка углом)",
        "round": 3,
        "time": "2:13",
        "event": "K-1: Dynamite 2007"
      }
    ],
    "biography": [
      "Зулузиньо, настоящее имя Вагнер да Консейсао Мартинс, — бразильский боец смешанных единоборств, выступающий в супертяжелой весовой категории. Родился 19 мая 1978 года в Сан-Луисе, Мараньян, Бразилия.",
      "Известен своими габаритами: рост 200 см и вес около 198 кг. Начал профессиональную карьеру в MMA в середине 2000-х годов, тренируется в команде Dark Horse MMA.",
      "За свою карьеру провел 25 боев, одержав 12 побед, из которых 10 — нокаутом. В числе его соперников были такие известные бойцы, как Икухиса Минова и Петр Романкевич.",
      "Зулузиньо продолжает выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Гильберто Диас",
    "nickname": "Cangaceiro",
    "image": "/fighters/Gilberto_Dias.png",
    "url": "/fighters/gilberto_dias",
    "nationality": "brazil",
    "weightClass": "flyweight",
    "record": "28-8-2",
    "details": {
      "Возраст": "41 год",
      "Дата рождения": "20 марта 1984 года",
      "Рост": "165 см",
      "Вес": "54 кг",
      "Город": "Бразилиа, Федеральный округ, Бразилия",
      "Команда": "Constrictor Team"
    },
    "stats": {
      "Победы": 28,
      "Поражения": 8,
      "Нокаутов": 2,
      "Сабмишены": 15,
      "Решения": 11
    },
    "fightHistory": [
      {
        "date": "25 мая 2024",
        "opponent": "Антонио Сезар",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "Jungle Fight 126"
      },
      {
        "date": "8 декабря 2023",
        "opponent": "Мехди Байдулаев",
        "result": "Loss",
        "method": "Сабмишн (удушение Дарса)",
        "round": 1,
        "time": "1:05",
        "event": "ACA 167: Baydulaev vs Dias"
      },
      {
        "date": "21 мая 2023",
        "opponent": "Родриго Сарафиан",
        "result": "Win",
        "method": "Сабмишн",
        "round": 1,
        "time": "5:00",
        "event": "Jungle Fight 125"
      }
    ],
    "biography": [
      "Гильберто Диас, известный под прозвищем 'Cangaceiro', — бразильский боец смешанных единоборств, выступающий в наилегчайшей весовой категории. Родился 20 марта 1984 года в Консейсан-ду-Арагуая, штат Пара, Бразилия.",
      "Начал профессиональную карьеру в ММА в 2009 году. Тренируется в команде Constrictor Team в Бразилиа.",
      "За свою карьеру провел 38 боев, одержав 28 побед, из которых 15 — сабмишном. Известен своими навыками в борьбе и грэпплинге.",
      "Продолжает активно выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Густаво Эрак",
    "nickname": "",
    "image": "/fighters/Gustavo_Erak.png",
    "url": "/fighters/gustavo_erak",
    "nationality": "brazil",
    "weightClass": "featherweight",
    "record": "25-9-2",
    "details": {
      "Возраст": "32 года",
      "Дата рождения": "8 мая 1992 года",
      "Рост": "170 см",
      "Размах рук": "173 см",
      "Вес": "61 кг",
      "Город": "Индаитуба, Сан-Паулу, Бразилия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 25,
      "Поражения": 9,
      "Нокаутов": 14,
      "Сабмишены": 3,
      "Решения": 8
    },
    "fightHistory": [
      {
        "date": "11 мая 2024",
        "opponent": "Константин Симонов",
        "result": "Loss",
        "method": "Сабмишн (удушение сзади)",
        "round": 2,
        "time": "2:15",
        "event": "RCC 19"
      },
      {
        "date": "4 февраля 2023",
        "opponent": "Жигимантас Рамашка",
        "result": "Loss",
        "method": "КО/ТКО",
        "round": 2,
        "time": "1:37",
        "event": "Blade Fights 1"
      },
      {
        "date": "25 января 2019",
        "opponent": "Диего Сантос",
        "result": "Win",
        "method": "КО/ТКО (удары)",
        "round": 1,
        "time": "4:11",
        "event": "Future FC 1"
      }
    ],
    "biography": [
      "Густаво Эрак — бразильский боец смешанных единоборств, выступающий в полулёгкой весовой категории. Родился 8 мая 1992 года в Индаитубе, штат Сан-Паулу, Бразилия.",
      "Начал профессиональную карьеру в ММА в 2013 году. Тренируется в команде Dark Horse MMA.",
      "За свою карьеру провёл 36 боёв, одержав 25 побед, из которых 14 — нокаутом. Известен своей агрессивной стойкой и умением завершать бои досрочно.",
      "Продолжает активно выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Тиагро Коста",
    "nickname": "URSO BRANCO",
    "image": "/fighters/Taigro_Costa.png",
    "url": "/fighters/taigro_costa",
    "nationality": "brazil",
    "weightClass": "bantamweight",
    "record": "19-8-0",
    "details": {
      "Возраст": "37 лет",
      "Дата рождения": "19 марта 1988 года",
      "Рост": "170 см",
      "Размах рук": "175 см",
      "Вес": "61 кг",
      "Город": "Сан-Луис, Мараньян, Бразилия",
      "Команда": "Tata Fight Team Maranhão"
    },
    "stats": {
      "Победы": 19,
      "Поражения": 8,
      "Нокаутов": 3,
      "Сабмишены": 5,
      "Решения": 11
    },
    "fightHistory": [
      {
        "date": "2 августа 2024",
        "opponent": "Вивертон Карвальо",
        "result": "Win",
        "method": "Сабмишн (удушение сзади)",
        "round": 2,
        "time": "4:22",
        "event": "Shooto Brasil 124"
      },
      {
        "date": "6 мая 2022",
        "opponent": "Магомедшапи Гасаниев",
        "result": "Loss",
        "method": "Решение (раздельное)",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 111"
      },
      {
        "date": "26 июля 2019",
        "opponent": "Херберт Соуса",
        "result": "Loss",
        "method": "Сабмишн (гильотина)",
        "round": 1,
        "time": "3:10",
        "event": "Future FC 7"
      }
    ],
    "biography": [
      "Тиагро Коста, известный под прозвищем 'URSO BRANCO', — бразильский боец смешанных единоборств, выступающий в легчайшей весовой категории. Родился 19 марта 1988 года в Виана, штат Мараньян, Бразилия.",
      "Начал профессиональную карьеру в ММА в 2009 году. Тренируется в команде Tata Fight Team Maranhão в Сан-Луисе.",
      "За свою карьеру провел 27 боев, одержав 19 побед, из которых 3 — нокаутом и 5 — сабмишном. Известен своими навыками в борьбе и стойкости в поединках.",
      "Продолжает активно выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Джиованни да Сильва",
    "nickname": "SOLDADO",
    "image": "/fighters/Giovanni_da_Silva.png",
    "url": "/fighters/giovanni_da_silva",
    "nationality": "brazil",
    "weightClass": "bantamweight",
    "record": "18-4-0",
    "details": {
      "Возраст": "37 лет",
      "Дата рождения": "2 мая 1987 года",
      "Рост": "168 см",
      "Вес": "62 кг",
      "Город": "Жуан-Песоа, Параиба, Бразилия",
      "Команда": "Pelopes Fight Team"
    },
    "stats": {
      "Победы": 18,
      "Поражения": 4,
      "Нокаутов": 6,
      "Сабмишены": 7,
      "Решения": 5
    },
    "fightHistory": [
      {
        "date": "13 июля 2019",
        "opponent": "Тимур Валиев",
        "result": "Loss",
        "method": "TKO (удары)",
        "round": 1,
        "time": "3:58",
        "event": "GFC 14: Dagestan"
      },
      {
        "date": "10 марта 2018",
        "opponent": "Лайсон Безерра",
        "result": "Win",
        "method": "TKO (удары)",
        "round": 1,
        "time": "1:38",
        "event": "Action Fight 8"
      },
      {
        "date": "25 января 2018",
        "opponent": "Клеодонилсон Силва",
        "result": "Win",
        "method": "Сабмишн (гильотина)",
        "round": 1,
        "time": "2:51",
        "event": "GFC 56"
      }
    ],
    "biography": [
      "Джиованни да Сильва, известный под прозвищем 'SOLDADO', — бразильский боец смешанных единоборств, выступающий в легчайшей весовой категории. Родился 2 мая 1987 года в Параибе, Бразилия.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Pelopes Fight Team в Жуан-Песоа.",
      "За свою карьеру провел 22 боя, одержав 18 побед, из которых 6 — нокаутом и 7 — сабмишном. Известен своей универсальностью и умением завершать бои досрочно.",
      "Продолжает активно выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Джахонгир Саиджамолов",
    "nickname": "",
    "image": "/fighters/Jahongir_Saidjamolov.png",
    "url": "/fighters/jahongir_saidjamolov",
    "nationality": "tajikistan",
    "weightClass": "welterweight",
    "record": "16-5-0",
    "details": {
      "Возраст": "29 лет",
      "Дата рождения": "22 сентября 1995 года",
      "Рост": "175 см",
      "Вес": "73 кг",
      "Город": "Таджикистан",
      "Команда": "Akhmat Fight Club Tajikistan"
    },
    "stats": {
      "Победы": 16,
      "Поражения": 5,
      "Нокаутов": 11,
      "Сабмишены": 0,
      "Решения": 5
    },
    "fightHistory": [
      {
        "date": "29 января 2022",
        "opponent": "Залимхан Юсупов",
        "result": "Win",
        "method": "Решение (раздельное)",
        "round": 3,
        "time": "5:00",
        "event": "Open Fighting Championship 16"
      },
      {
        "date": "16 января 2021",
        "opponent": "Кубанычбек Абдысалам уулу",
        "result": "Loss",
        "method": "Сабмишн (удушение сзади)",
        "round": 2,
        "time": "2:05",
        "event": "BRAVE CF 46"
      },
      {
        "date": "16 октября 2020",
        "opponent": "Анвар Чергесов",
        "result": "Win",
        "method": "Решение (большинством голосов)",
        "round": 3,
        "time": "5:00",
        "event": "GFC 29"
      }
    ],
    "biography": [
      "Джахонгир Саиджамолов — таджикский боец смешанных единоборств, выступающий в полусредней весовой категории. Родился 22 сентября 1995 года в Таджикистане.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Akhmat Fight Club Tajikistan.",
      "За свою карьеру провел 21 бой, одержав 16 побед, из которых 11 — нокаутом. Известен своей ударной техникой и агрессивным стилем ведения боя.",
      "Продолжает активно выступать на профессиональном уровне, представляя таджикскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Фернандо Сантос Джуниор",
    "nickname": "SANTO FORTE",
    "image": "/fighters/Fernando_Santo_Forte.png",
    "url": "/fighters/fernando_santo_forte",
    "nationality": "brazil",
    "weightClass": "heavyweight",
    "record": "13-9-0",
    "details": {
      "Возраст": "37 лет",
      "Дата рождения": "29 мая 1987 года",
      "Рост": "190 см",
      "Размах рук": "196 см",
      "Вес": "114 кг",
      "Город": "Сан-Паулу, Бразилия",
      "Команда": "Corinthians MMA"
    },
    "stats": {
      "Победы": 13,
      "Поражения": 9,
      "Нокаутов": 9,
      "Сабмишены": 2,
      "Решения": 2
    },
    "fightHistory": [
      {
        "date": "15 декабря 2023",
        "opponent": "Алексей Олейник",
        "result": "Loss",
        "method": "Сабмишн (удушение сзади)",
        "round": 1,
        "time": "3:35",
        "event": "RCC 17"
      },
      {
        "date": "12 октября 2023",
        "opponent": "Хадис Ибрагимов",
        "result": "Loss",
        "method": "Нокаут (удары)",
        "round": 1,
        "time": "3:59",
        "event": "Hardcore FC 62"
      },
      {
        "date": "19 марта 2022",
        "opponent": "Владимир Минеев",
        "result": "Loss",
        "method": "Нокаут (удары)",
        "round": 2,
        "time": "1:15",
        "event": "FKR PRO 1"
      }
    ],
    "biography": [
      "Фернандо Сантос Джуниор, известный под прозвищем 'SANTO FORTE', — бразильский боец смешанных единоборств, выступающий в тяжелой весовой категории. Родился 29 мая 1987 года в Сан-Паулу, Бразилия.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Corinthians MMA.",
      "За свою карьеру провел 22 боя, одержав 13 побед, из которых 9 — нокаутом и 2 — сабмишном. Известен своей ударной мощью и агрессивным стилем ведения боя.",
      "Продолжает активно выступать на профессиональном уровне, представляя бразильскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Магомед Сулумов",
    "nickname": "",
    "image": "/fighters/Magomed_Sulumov.png",
    "url": "/fighters/magomed_sulumov",
    "nationality": "russia",
    "weightClass": "lightweight",
    "record": "12-4-0, 1 NC",
    "details": {
      "Возраст": "28 лет",
      "Дата рождения": "18 февраля 1997 года",
      "Рост": "174 см",
      "Вес": "66 кг",
      "Город": "Грозный, Россия",
      "Команда": "Berkut FC",
      "Стиль": "Боевое самбо"
    },
    "stats": {
      "Победы": 12,
      "Поражения": 4,
      "Нокаутов": 3,
      "Сабмишены": 2,
      "Решения": 7
    },
    "fightHistory": [
      {
        "date": "6 декабря 2024",
        "opponent": "Александр Грозин",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 5,
        "time": "5:00",
        "event": "Nashe Delo 86"
      },
      {
        "date": "23 августа 2024",
        "opponent": "Эдуард Вартанян",
        "result": "Win",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "Nashe Delo 85"
      },
      {
        "date": "25 августа 2019",
        "opponent": "Аким Рахимов",
        "result": "Win",
        "method": "Технический нокаут",
        "round": 1,
        "time": "5:00",
        "event": "OFC 6"
      }
    ],
    "biography": [
      "Магомед Сулумов — российский боец смешанных единоборств, выступающий в легкой весовой категории. Родился 18 февраля 1997 года в России.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Berkut FC в Грозном.",
      "За свою карьеру провел 17 боев, одержав 12 побед, из которых 3 — нокаутом и 2 — сабмишном. Известен своей техникой и стратегическим подходом к боям.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Наби Ашурлаев",
    "nickname": "",
    "image": "/fighters/Nabi_Ashurlaev.png",
    "url": "/fighters/nabi_ashurlaev",
    "nationality": "russia",
    "weightClass": "featherweight",
    "record": "11-1-0",
    "details": {
      "Возраст": "30 лет",
      "Дата рождения": "26 сентября 1994 года",
      "Рост": "172 см",
      "Вес": "66 кг",
      "Город": "Дагестан, Россия",
      "Команда": "Gorets FT"
    },
    "stats": {
      "Победы": 11,
      "Поражения": 1,
      "Нокаутов": 6,
      "Сабмишены": 2,
      "Решения": 3
    },
    "fightHistory": [
      {
        "date": "12 июня 2024",
        "opponent": "Андрей Евдокимов",
        "result": "Win",
        "method": "Сабмишн (удушение Д'арсе)",
        "round": 1,
        "time": "4:21",
        "event": "Nashe Delo 84"
      },
      {
        "date": "27 ноября 2023",
        "opponent": "Сергей Андреев",
        "result": "Win",
        "method": "Решение",
        "round": 3,
        "time": "5:00",
        "event": "Nashe Delo"
      },
      {
        "date": "14 июня 2023",
        "opponent": "Бекбулат Магомедов",
        "result": "Win",
        "method": "ТКО (травма)",
        "round": 1,
        "time": "5:00",
        "event": "Nashe Delo: Khachatryan vs. Divnich"
      }
    ],
    "biography": [
      "Наби Ашурлаев — российский боец смешанных единоборств, выступающий в полулегкой весовой категории. Родился 26 сентября 1994 года в Дагестане, Россия.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Gorets FT.",
      "За свою карьеру провел 12 боев, одержав 11 побед, из которых 6 — нокаутом и 2 — сабмишном. Известен своей техникой и стратегическим подходом к боям.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Магомедгаджи Зиражудинов",
    "nickname": "",
    "image": "/fighters/Magomedgadzhi_Sirazhudinov.png",
    "url": "/fighters/magomedgadzhi_sirazhudinov",
    "nationality": "russia",
    "weightClass": "featherweight",
    "record": "10-2-0",
    "details": {
      "Возраст": "28 лет",
      "Дата рождения": "5 сентября 1996 года",
      "Рост": "165 см",
      "Город": "Махачкала, Дагестан, Россия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 10,
      "Поражения": 2,
      "Нокаутов": 2,
      "Сабмишены": 4,
      "Решения": 4
    },
    "fightHistory": [
      {
        "date": "30 июля 2022",
        "opponent": "Султан Жолдошбек уулу",
        "result": "Loss",
        "method": "Раздельное решение",
        "round": 3,
        "time": "5:00",
        "event": "Alash Pride 75"
      },
      {
        "date": "17 июля 2021",
        "opponent": "Максим Усоян",
        "result": "Win",
        "method": "ТКО (удар коленом в прыжке и добивание)",
        "round": 1,
        "time": "2:53",
        "event": "RCC: Intro 14"
      },
      {
        "date": "10 апреля 2021",
        "opponent": "Баходир Бакиев",
        "result": "Win",
        "method": "ТКО (удары)",
        "round": 2,
        "time": "5:00",
        "event": "AMC Fight Nights 100"
      }
    ],
    "biography": [
      "Магомедгаджи Зиражудинов — российский боец смешанных единоборств, выступающий в полулегкой весовой категории. Родился 5 сентября 1996 года в Махачкале, Дагестан, Россия.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Dark Horse MMA.",
      "За свою карьеру провел 12 боев, одержав 10 побед, из которых 2 — нокаутом и 4 — сабмишном. Известен своей техникой и стратегическим подходом к боям.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Нутсалхан Умаханов",
    "nickname": "",
    "image": "/fighters/Nutsalkhan_Umakhanov.png",
    "url": "/fighters/nutsalkhan_umakhanov",
    "nationality": "russia",
    "weightClass": "middleweight",
    "record": "7-3-0, 1 NC",
    "details": {
      "Возраст": "33 года",
      "Дата рождения": "25 июля 1991 года",
      "Рост": "186 см",
      "Город": "Россия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 7,
      "Поражения": 3,
      "Нокаутов": 4,
      "Сабмишены": 2,
      "Решения": 1
    },
    "fightHistory": [
      {
        "date": "23 августа 2024",
        "opponent": "Геннадий Макарян",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 124"
      },
      {
        "date": "20 декабря 2020",
        "opponent": "Константин Линник",
        "result": "Win",
        "method": "ТКО",
        "round": 1,
        "time": "0:49",
        "event": "Eagle FC 31"
      },
      {
        "date": "28 мая 2017",
        "opponent": "Олег Мисхожев",
        "result": "Win",
        "method": "ТКО",
        "round": 1,
        "time": "2:13",
        "event": "Moscow Battle Pro MMA: First Step"
      }
    ],
    "biography": [
      "Нутсалхан Умаханов — российский боец смешанных единоборств, выступающий в средней весовой категории. Родился 25 июля 1991 года в России.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Dark Horse MMA.",
      "За свою карьеру провел 11 боев, одержав 7 побед, из которых 4 — нокаутом и 2 — сабмишном. Известен своей техникой и стратегическим подходом к боям.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Култаев Сыймык",
    "nickname": "",
    "image": "/fighters/Syymyk_Kultaev_.png",
    "url": "/fighters/syymyk_kultaev",
    "nationality": "kyrgyzstan",
    "weightClass": "featherweight",
    "record": "6-2-0",
    "details": {
      "Возраст": "27 лет",
      "Дата рождения": "1 ноября 1997 года",
      "Рост": "163 см",
      "Город": "Красноярск, Россия",
      "Команда": "Evolve Gym"
    },
    "stats": {
      "Победы": 6,
      "Поражения": 2,
      "Нокаутов": 1,
      "Сабмишены": 5,
      "Решения": 0
    },
    "fightHistory": [
      {
        "date": "25 марта 2022",
        "opponent": "Шамиль Бахачалиев",
        "result": "Win",
        "method": "Сабмишн (удушение сзади)",
        "round": 1,
        "time": "3:00",
        "event": "AMC Fight Nights 110"
      },
      {
        "date": "15 июля 2021",
        "opponent": "Магомед Сулумов",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 103"
      },
      {
        "date": "25 августа 2018",
        "opponent": "Оюн Амилат",
        "result": "Win",
        "method": "Сабмишн (удушение)",
        "round": 1,
        "time": "5:00",
        "event": "Battle of Nomads 2018"
      }
    ],
    "biography": [
      "Култаев Сыймык — профессиональный боец смешанных единоборств из Кыргызстана, выступающий в полулегкой весовой категории. Родился 1 ноября 1997 года в Красноярске, Россия.",
      "Начал профессиональную карьеру в ММА, тренируясь в команде Evolve Gym.",
      "За свою карьеру провел 8 боев, одержав 6 побед, из которых 1 — нокаутом и 5 — сабмишном. Известен своей техникой и стратегическим подходом к боям.",
      "Продолжает активно выступать на профессиональном уровне, представляя кыргызскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Виктор Вечерин",
    "nickname": "",
    "image": "/fighters/VIktor_Vecherin.jpg",
    "url": "/fighters/viktor_vecherin",
    "nationality": "russia",
    "weightClass": "light-heavyweight",
    "record": "5-6-0",
    "details": {
      "Возраст": "Информация отсутствует",
      "Рост": "178 см",
      "Город": "Красноярск, Россия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 5,
      "Поражения": 6,
      "Нокаутов": 1,
      "Сабмишены": 0,
      "Решения": 4
    },
    "fightHistory": [
      {
        "date": "10 ноября 2023",
        "opponent": "Ризван Абдурахманов",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 122"
      },
      {
        "date": "9 сентября 2023",
        "opponent": "Михаил Колобегов",
        "result": "Loss",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "Open Fighting Championship 34"
      },
      {
        "date": "23 февраля 2023",
        "opponent": "Эльдар Тагиров",
        "result": "Win",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 118"
      }
    ],
    "biography": [
      "Виктор Вечерин — российский боец смешанных единоборств, выступающий в полутяжелой весовой категории. Тренируется в команде Dark Horse MMA в Красноярске, Россия.",
      "Начал профессиональную карьеру в ММА, участвуя в различных турнирах и соревнованиях.",
      "За свою карьеру провел 11 боев, одержав 5 побед, из которых 1 — нокаутом и 4 — решением судей.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Камил Гусейнов",
    "nickname": "",
    "image": "/fighters/Kamil_Guseynov.png",
    "url": "/fighters/kamil_guseynov",
    "nationality": "russia",
    "weightClass": "heavyweight",
    "record": "4-0-0",
    "details": {
      "Возраст": "Информация отсутствует",
      "Рост": "Информация отсутствует",
      "Вес": "105 кг",
      "Город": "Россия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 4,
      "Поражения": 0,
      "Нокаутов": 3,
      "Сабмишены": 0,
      "Решения": 1
    },
    "fightHistory": [
      {
        "date": "22 ноября 2024",
        "opponent": "Амин Нури",
        "result": "Win",
        "method": "ТКО (удары)",
        "round": 1,
        "time": "1:35",
        "event": "Ural FC 9: Myasnikov vs Kovalev"
      },
      {
        "date": "14 июля 2023",
        "opponent": "Андрей Луконин",
        "result": "Win",
        "method": "ТКО (граунд-энд-паунд)",
        "round": 1,
        "time": "1:44",
        "event": "AMC Fight Nights 121"
      },
      {
        "date": "25 марта 2022",
        "opponent": "Евгений Мякинкин",
        "result": "Win",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 110"
      },
      {
        "date": "16 марта 2021",
        "opponent": "Максад Мансуров",
        "result": "Win",
        "method": "КО",
        "round": 1,
        "time": "2:38",
        "event": "AMC Fight Nights"
      }
    ],
    "biography": [
      "Камил Гусейнов — российский боец смешанных единоборств, выступающий в тяжелой весовой категории. Тренируется в команде Dark Horse MMA.",
      "Начал профессиональную карьеру в ММА в 2021 году и с тех пор провел 4 боя, одержав победы во всех из них. Известен своей нокаутирующей мощью, завершив 3 из 4 боев досрочно.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  },
  {
    "name": "Аслан Ораз",
    "nickname": "JOKER",
    "image": "/fighters/Aslan_Oraz.png",
    "url": "/fighters/aslan_oraz",
    "nationality": "kazakhstan",
    "weightClass": "featherweight",
    "record": "3-1-1",
    "details": {
      "Возраст": "Информация отсутствует",
      "Рост": "178 см",
      "Вес": "Информация отсутствует",
      "Город": "Нур-Султан, Казахстан",
      "Команда": "Tobet Top Team"
    },
    "stats": {
      "Победы": 3,
      "Поражения": 1,
      "Ничьи": 1,
      "Нокаутов": 2,
      "Сабмишены": 0,
      "Решения": 1
    },
    "fightHistory": [
      {
        "date": "25 августа 2021",
        "opponent": "Шаммас Абдул Латефф",
        "result": "Win",
        "method": "Решение",
        "round": 3,
        "time": "5:00",
        "event": "GAMMA: Asian Championships 2021"
      },
      {
        "date": "3 октября 2020",
        "opponent": "Сержан Сапаргалиев",
        "result": "Loss",
        "method": "Раздельное решение",
        "round": 3,
        "time": "5:00",
        "event": "Naiza FC 24"
      },
      {
        "date": "31 января 2020",
        "opponent": "Айжигит Эркебай уулу",
        "result": "Win",
        "method": "ТКО",
        "round": 1,
        "time": "5:00",
        "event": "Naiza FC 22"
      },
      {
        "date": "25 марта 2018",
        "opponent": "Сырым Бектурсун",
        "result": "Win",
        "method": "ТКО",
        "round": 1,
        "time": "5:00",
        "event": "Triumph Fights"
      }
    ],
    "biography": [
      "Асла́н Ора́з — профессиональный боец ММА из Нур-Султана, Казахстан, выступающий в полулёгкой весовой категории. Тренируется в команде Tobet Top Team.",
      "Начал профессиональную карьеру в 2018 году и с тех пор провел 5 боев, одержав 3 победы, из которых 2 — нокаутом, и потерпев 1 поражение.",
      "Известен своей агрессивной стойкой и стремлением завершить бой досрочно, что подтверждается его победами нокаутом в первом раунде."
    ]
  },
  {
    "name": "Ричард Тотров",
    "nickname": "",
    "image": "/fighters/richard_totrov.png",
    "url": "/fighters/richard_totrov",
    "nationality": "russia",
    "weightClass": "Полусредний вес",
    "record": "12-8-0",
    "details": {
      "Возраст": "Информация отсутствует",
      "Рост": "Информация отсутствует",
      "Вес": "77 кг",
      "Город": "Владикавказ, Россия",
      "Команда": "Dark Horse MMA"
    },
    "stats": {
      "Победы": 12,
      "Поражения": 8,
      "Нокаутов": 2,
      "Сабмишены": 1,
      "Решения": 5
    },
    "fightHistory": [
      {
        "date": "17 мая 2024",
        "opponent": "Хамзат Чапанов",
        "result": "Loss",
        "method": "Сабмишен (треугольник)",
        "round": 1,
        "time": "2:16",
        "event": "Octagon 58"
      },
      {
        "date": "21 октября 2022",
        "opponent": "Али Искендер Алиев",
        "result": "Win",
        "method": "Раздельное решение",
        "round": 3,
        "time": "5:00",
        "event": "Octagon 36"
      },
      {
        "date": "30 октября 2021",
        "opponent": "Хамзат Чапанов",
        "result": "Win",
        "method": "Единогласное решение",
        "round": 3,
        "time": "5:00",
        "event": "MMA Series 43"
      },
      {
        "date": "18 июня 2021",
        "opponent": "Михаил Аллахвердян",
        "result": "Win",
        "method": "Раздельное решение",
        "round": 3,
        "time": "5:00",
        "event": "AMC Fight Nights 102"
      },
      {
        "date": "12 апреля 2021",
        "opponent": "Саутин уулу",
        "result": "Win",
        "method": "Сабмишен (рычаг локтя)",
        "round": 1,
        "time": "4:10",
        "event": "Fury FC"
      }
    ],
    "biography": [
      "Ричард Тотров — российский боец смешанных единоборств, выступающий в полусредней весовой категории. Представляет команду Dark Horse MMA из Владикавказа, Россия.",
      "Начал профессиональную карьеру в ММА, участвуя в различных турнирах и соревнованиях.",
      "За свою карьеру провел 20 боев, одержав 12 побед, из которых 2 — нокаутом, 1 — сабмишеном и 5 — решением судей.",
      "Продолжает активно выступать на профессиональном уровне, представляя российскую школу смешанных единоборств."
    ]
  }
];

export const countryFlags = {
  "russia": "/flags/russia.jpg",
  "brazil": "/flags/brazil.jpg",
  "tajikistan": "/flags/tajikistan.jpg",
  "kyrgyzstan": "/flags/kyrgyzstan.jpg",
  "kazakhstan": "/flags/kazakhstan.jpg",
  "usa": "/flags/usa.jpg",
  "ireland": "/flags/usa.jpg",
  "nigeria": "/flags/usa.jpg"
};
